openresty/resty-cli.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-03-25 三 16:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>resty-cli</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="liushangliang" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">resty-cli</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc5f0e54">1. 概述</a></li>
<li><a href="#org33240c5">2. 使用</a>
<ul>
<li><a href="#org45599f9">2.1. <code>--errlog-level LEVEL</code></a></li>
<li><a href="#org00402be">2.2. <code>--http-include PATH</code></a></li>
<li><a href="#org58b8e64">2.3. <code>-I DIR</code></a></li>
<li><a href="#org26b56d6">2.4. <code>--ns IP</code></a></li>
<li><a href="#org7147765">2.5. <code>--shdict 'NAME SIZE'</code></a></li>
<li><a href="#org7b25af8">2.6. <code>--stap</code></a></li>
<li><a href="#orge764171">2.7. <code>--stap-opts OPTS</code></a></li>
<li><a href="#org4793454">2.8. <code>-V</code></a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgc5f0e54" class="outline-2">
<h2 id="orgc5f0e54"><span class="section-number-2">1</span> 概述</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://github.com/openresty/resty-cli">resty</a> 命令行实用程序可像 lua 或 luajit 命令行实用程序一样，直接从命令行运行 OpenResty 的 Lua 脚本。它可以使用 OpenResty Lua 创建各种命令行实用程序。
</p>

<p>
该工具通过创建 head-less nginx 实例，禁用守护程序，master_process，access_log 以及其他不需要的东西来工作。没有配置 <code>server {}</code> ，因此根本不涉及侦听套接字。
</p>

<p>
Lua 代码由 init_worker_by_lua 指令启动，并在 ngx.timer 回调的上下文中运行。因此，在 ngx.timer 回调上下文中可用的所有 ngx_lua 的 Lua API 也可以在 resty 实用程序中使用。不过，我们将来可能会删除一些剩余的限制。
</p>
</div>
</div>

<div id="outline-container-org33240c5" class="outline-2">
<h2 id="org33240c5"><span class="section-number-2">2</span> 使用</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org45599f9" class="outline-3">
<h3 id="org45599f9"><span class="section-number-3">2.1</span> <code>--errlog-level LEVEL</code></h3>
<div class="outline-text-3" id="text-2-1">
<p>
Set nginx error_log level.Can be debug, info, notice, warn, error, crit, alert,or emerg.
</p>

<p>
执行：
</p>
<div class="org-src-container">
<pre class="src src-sh">./bin/resty --errlog-level=debug -e <span style="color: #ff4ea3;">'ngx.say("hello")'</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org00402be" class="outline-3">
<h3 id="org00402be"><span class="section-number-3">2.2</span> <code>--http-include PATH</code></h3>
<div class="outline-text-3" id="text-2-2">
<p>
nginx http 配置块中包含的文件，可以包含多个配置文件。
</p>
</div>
</div>

<div id="outline-container-org58b8e64" class="outline-3">
<h3 id="org58b8e64"><span class="section-number-3">2.3</span> <code>-I DIR</code></h3>
<div class="outline-text-3" id="text-2-3">
<p>
添加搜索 lua 库的目录。
</p>
<div class="org-src-container">
<pre class="src src-sh">./bin/resty -I /Users/lsl/.luarocks/share/lua/5.3/ resty-cli/lib.lua
</pre>
</div>
</div>
</div>

<div id="outline-container-org26b56d6" class="outline-3">
<h3 id="org26b56d6"><span class="section-number-3">2.4</span> <code>--ns IP</code></h3>
<div class="outline-text-3" id="text-2-4">
<p>
指定名字服务地址。
</p>
</div>
</div>

<div id="outline-container-org7147765" class="outline-3">
<h3 id="org7147765"><span class="section-number-3">2.5</span> <code>--shdict 'NAME SIZE'</code></h3>
<div class="outline-text-3" id="text-2-5">
<p>
在 HTTP 代码块中创建内存字典，可以同时设置多个。
</p>

<div class="org-src-container">
<pre class="src src-sh">./bin/resty --shdict <span style="color: #ff4ea3;">'dogs 1m'</span> resty-cli/shm.lua
</pre>
</div>
</div>
</div>

<div id="outline-container-org7b25af8" class="outline-3">
<h3 id="org7b25af8"><span class="section-number-3">2.6</span> <code>--stap</code></h3>
<div class="outline-text-3" id="text-2-6">
<p>
使用 sysetmtap 运行底层 nginx C process.
</p>
</div>
</div>

<div id="outline-container-orge764171" class="outline-3">
<h3 id="orge764171"><span class="section-number-3">2.7</span> <code>--stap-opts OPTS</code></h3>
<div class="outline-text-3" id="text-2-7">
<p>
systemtap 命令行选项。
</p>
</div>
</div>

<div id="outline-container-org4793454" class="outline-3">
<h3 id="org4793454"><span class="section-number-3">2.8</span> <code>-V</code></h3>
<div class="outline-text-3" id="text-2-8">
<p>
打印版本号和 nginx 配置。
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: liushangliang</p>
<p class="email">Email: <a href="mailto:phenix3443+github@gmail.com">phenix3443+github@gmail.com</a></p>
<p class="date">Created: 2020-03-25 三 16:17</p>
<p class="validation"></p>
</div>
</body>
</html>
